// import Footer from "../../components/footer/Footer";
import Navbar from "../../components/navbar/Navbar";
import aboutPic from "./about.module.css";
import javaPic from "../../assets/img/java-pic.png";
import Footer from "../../components/footer/Footer";

function AboutUs() {
  return (
    <div>
      <Navbar />
      <div className="container">
        <div className={aboutPic.aboutPage}>
          <h2>درباره ما </h2>
          <p>
            جاوااسکریپت (JavaScript) یکی از پرکاربردترین و محبوب‌ترین زبان‌های
            برنامه‌نویسی در دنیای وب است. این زبان در ابتدا توسط شرکت Netscape
            در سال 1995 توسعه داده شد و هدف اصلی آن، ایجاد پویایی و تعامل در
            صفحات وب بود. با استفاده از جاوااسکریپت می‌توان به صفحات HTML جان
            بخشید، رویدادهای کاربر مانند کلیک یا حرکت موس را کنترل کرد، محتوای
            صفحه را بدون نیاز به بارگذاری مجدد تغییر داد و رابط‌های کاربری غنی و
            تعاملی ساخت. جاوااسکریپت برخلاف نامش، هیچ ارتباطی با زبان Java
            ندارد. این زبان امروزه هم در فرانت‌اند (سمت کاربر) و هم در بک‌اند
            (سمت سرور) استفاده می‌شود. در سمت فرانت‌اند، جاوااسکریپت در کنار
            HTML و CSS هسته‌ی اصلی طراحی وب‌سایت‌ها را تشکیل می‌دهد. در سمت
            بک‌اند نیز با کمک فریم‌ورک‌هایی مانند Node.js، برنامه‌نویسان
            می‌توانند اپلیکیشن‌های سمت سرور را نیز با جاوااسکریپت توسعه دهند. از
            دیگر ویژگی‌های جاوااسکریپت می‌توان به یادگیری نسبتاً آسان، پشتیبانی
            گسترده مرورگرها، جامعه‌ی فعال توسعه‌دهندگان، و وجود کتابخانه‌ها و
            فریم‌ورک‌های قدرتمندی مانند React، Angular و Vue اشاره کرد. این
            عوامل باعث شده‌اند جاوااسکریپت به یک زبان همه‌کاره و پرتقاضا در
            بازار کار تبدیل شود.
          </p>
          <div className={aboutPic.aboutPicCon}>
            <img src={javaPic} alt="تصویر سایت" />
          </div>
        </div>
      </div>
      <Footer />
    </div>
  );
}

export default AboutUs;
